## Exercice 1 : Objet -> Class

In [1]:
class Produit : 
    def __init__(self,name,price,quantity) : 
        # attributs d'instance 
        self.nom = name
        self.prix = price
        self.qte = quantity
    def valeur_stock(self) : 
        return self.prix * self.qte
    def __str__(self) : 
        return f"Produit : {self.nom}, Prix : {self.prix}€, Quantité : {self.qte}"

In [2]:
produit = Produit("Clavier",20,5)
print(produit.valeur_stock())
print(produit) #pareil que print(__str__())

100
Produit : Clavier, Prix : 20€, Quantité : 5

## Exercice 2 : Objet & DataFrame

In [3]:
import pandas as pd 
class Inventaire : 
    def __init__(self) :
        self.df = pd.DataFrame(columns=['nom', 'prix', 'quantite'])
        
    def ajouter_produit(self,name,price,quantity) : 
        self.df.loc[len(self.df)] = [name, price, quantity]

    def valeur_totale(self) : 
        return (self.df['prix'] * self.df['quantite']).sum()
        
    def afficher_produits(self):
        return self.df
    
    def produits_chers(self, prix_min) : 
        return self.df[self.df['prix']> prix_min]
    
    def trier_par_prix(self) : 
        return self.df.sort_values(by='prix', ascending=True)

In [4]:
i = Inventaire()
i.ajouter_produit("Ordinateur",550,10)
i.ajouter_produit("Souris",14,7)
print(i.afficher_produits())
print(i.valeur_totale())
print(i.produits_chers(200))
print(i.trier_par_prix())

          nom  prix  quantite
0  Ordinateur   550        10
1      Souris    14         7
5598
          nom  prix  quantite
0  Ordinateur   550        10
          nom  prix  quantite
1      Souris    14         7
0  Ordinateur   550        10

## Exercice 3 : List [] VS Tuple () ou muable VS immuable

In [5]:
notes = [12, 15, 9, 18, 12, 15]

In [6]:
tup_notes = tuple(sorted(notes)) # conversion list en tuple + tri
print(tup_notes) 
tup_notes[0] = 4 # ne fonctionne pas car tuple -> immuable

(9, 12, 12, 15, 15, 18)

TypeError: 'tuple' object does not support item assignment

## Exercice 4 : set -> unicité et performance

In [7]:
emails = [
    "a@mail.com", "b@mail.com", "a@mail.com",
    "c@mail.com", "b@mail.com"
]

In [8]:
clean_emails = list(set(emails)) # set -> liste elem unique
print(clean_emails)

['b@mail.com', 'a@mail.com', 'c@mail.com']

In [9]:
print('d@mail.com présent') if 'd@mail.com' in clean_emails else print('d@mail.com absent')

d@mail.com absent

## Exercice 5 : Dictionnaire

In [10]:
produits = {
    "Ordinateur": 550,
    "Souris": 14,
    "Clavier": 25
}

In [11]:
produits["HDMI"] = 10
print(produits)

{'Ordinateur': 550, 'Souris': 14, 'Clavier': 25, 'HDMI': 10}

In [12]:
for nom in produits:
    produits[nom] *= 1.1 # pour modifier une valeur il faut passer par la clé 
print(produits)

{'Ordinateur': 605.0, 'Souris': 15.400000000000002, 'Clavier': 27.500000000000004, 'HDMI': 11.0}

In [13]:
max(produits,key=produits.get)

'Ordinateur'

In [14]:
df_produits = pd.DataFrame.from_dict(produits, orient='index')

In [15]:
df_produits

                0
Ordinateur  605.0
Souris       15.4
Clavier      27.5
HDMI         11.0

## Exercice 6

In [16]:
data = {
    "nom": ["Alice", "Bob", "Alice", None, "David"],
    "age": [25, 30, 25, 40, None],
    "ville": ["Paris", "Lyon", "Paris", "Marseille", "Lille"]
}

In [17]:
df = pd.DataFrame.from_dict(data, orient='index').T # transposé matrice / orient='index' les clés du dico deviennent l'index 
df

     nom   age      ville
0  Alice    25      Paris
1    Bob    30       Lyon
2  Alice    25      Paris
3   None    40  Marseille
4  David  None      Lille

In [18]:
df = df.drop_duplicates() # suppression des doublons en vérifiant la ligne entière
df

     nom   age      ville
0  Alice    25      Paris
1    Bob    30       Lyon
3   None    40  Marseille
4  David  None      Lille

In [19]:
df = df.reset_index(drop=True)
df

     nom   age      ville
0  Alice    25      Paris
1    Bob    30       Lyon
2   None    40  Marseille
3  David  None      Lille

In [20]:
df = df.dropna()
df

     nom age  ville
0  Alice  25  Paris
1    Bob  30   Lyon

## Exercice 7

In [21]:
data = [
    ("Ordinateur", 550, 10),
    ("Souris", 14, 7),
    ("Clavier", 25, 15)
]

In [22]:
df7 = pd.DataFrame.from_dict(data)

In [23]:
df7.columns = ['article','prix','qte'] #renommer les colonnes 
df7["valeur_stock"] = df7["prix"]*df7["qte"] #création d'une nouvelle colonne 
df7

      article  prix  qte  valeur_stock
0  Ordinateur   550   10          5500
1      Souris    14    7            98
2     Clavier    25   15           375

In [24]:
df7 = df7[df7['prix'] >500].to_dict(orient='records') # pour exclure l'index 
df7

[{'article': 'Ordinateur', 'prix': 550, 'qte': 10, 'valeur_stock': 5500}]

## Exercice 8

In [29]:
import pandas as pd
from datetime import datetime

ventes = pd.DataFrame({
    "commande_id": [1, 1, 2, 3, 3, 3, 4],
    "produit": ["A", "B", "A", "A", "C", "C", "B"],
    "quantite": [1, 2, 3, 1, 2, 2, 1],
    "prix_unitaire": [100, 50, 100, 100, 200, 200, 50],
    "date": [
        "2024-01-01", "2024-01-01",
        "2024-01-02",
        "2024-01-03", "2024-01-03", "2024-01-03",
        "2024-01-04"
    ]
})
produits = pd.DataFrame({
    "produit": ["A", "B", "C", "D"],
    "categorie": ["Tech", "Accessoire", "Tech", "Service"],
    "cout_unitaire": [60, 20, 120, 10]
})

In [27]:
ventes.head()

   commande_id produit  quantite  prix_unitaire        date
0            1       A         1            100  2024-01-01
1            1       B         2             50  2024-01-01
2            2       A         3            100  2024-01-02
3            3       A         1            100  2024-01-03
4            3       C         2            200  2024-01-03

In [28]:
produits.head()

  produit   categorie  cout_unitaire
0       A        Tech             60
1       B  Accessoire             20
2       C        Tech            120
3       D     Service             10

In [35]:
ventes['date'] = pd.to_datetime(ventes['date'])

In [38]:
ventes = ventes.drop_duplicates(subset=["commande_id", "produit", "quantite", "date"])
produits = produits.drop_duplicates()

In [46]:
ventes.drop_duplicates(['produit','prix_unitaire']).filter(['produit','prix_unitaire']) # filter -> choix col affichage

  produit  prix_unitaire
0       A            100
1       B             50
4       C            200

In [49]:
ventes['chiffre_affaires_ligne'] = ventes['prix_unitaire'] * ventes['quantite']

In [50]:
ventes.head()

,commande_id,produit,quantite,prix_unitaire,date,chiffre_affaires_ligne
0,1,A,1,100,2024-01-01,100
1,1,B,2,50,2024-01-01,100
2,2,A,3,100,2024-01-02,300
3,3,A,1,100,2024-01-03,100
4,3,C,2,200,2024-01-03,400

In [64]:
df_merge = produits.merge(ventes, on='produit')
df_merge

,produit,categorie,cout_unitaire,commande_id,quantite,prix_unitaire,date,chiffre_affaires_ligne
0,A,Tech,60,1,1,100,2024-01-01,100
1,A,Tech,60,2,3,100,2024-01-02,300
2,A,Tech,60,3,1,100,2024-01-03,100
3,B,Accessoire,20,1,2,50,2024-01-01,100
4,B,Accessoire,20,4,1,50,2024-01-04,50
5,C,Tech,120,3,2,200,2024-01-03,400

In [67]:
df_merge['marge'] = df_merge['chiffre_affaires_ligne'] - df_merge['cout_unitaire']
df_merge[df_merge['marge'] > 100]

,produit,categorie,cout_unitaire,commande_id,quantite,prix_unitaire,date,chiffre_affaires_ligne,marge
1,A,Tech,60,2,3,100,2024-01-02,300,240
5,C,Tech,120,3,2,200,2024-01-03,400,280

In [76]:
marge_par_categorie = df_merge.groupby('categorie')['marge'].sum() #group by permet de grouper uniquement en vue de préparer une aggrégation donc rien ne se pase ici
marge_par_categorie

categorie
Accessoire    110
Tech          600
Name: marge, dtype: int64

In [83]:
a = df_merge.groupby('produit')['prix_unitaire'].sum().sort_values(ascending=False)[:2] # top 2 produits les plus rentables 
a

produit
A    300
C    200
Name: prix_unitaire, dtype: int64

## Exercice 9

In [24]:
import pandas as pd

df = pd.DataFrame({
    'nom': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'age': [25, 30, 35, 40, 28],
    'ville': ['Paris', 'Lyon', 'Paris', 'Marseille', 'Lille'],
    'salaire': [3000, 4000, 3500, 5000, 3200],
    'poste': ['Data', 'Dev', 'Data', 'Manager', 'Dev']
})

In [25]:
df.iloc[2:4]

       nom  age      ville  salaire    poste
2  Charlie   35      Paris     3500     Data
3    David   40  Marseille     5000  Manager

In [26]:
df.loc[:, ['nom','salaire']]

       nom  salaire
0    Alice     3000
1      Bob     4000
2  Charlie     3500
3    David     5000
4      Eva     3200

In [27]:
df.loc[df['nom'] == 'Bob']

   nom  age ville  salaire poste
1  Bob   30  Lyon     4000   Dev

In [28]:
df.loc[df['salaire'] > 3500]

     nom  age      ville  salaire    poste
1    Bob   30       Lyon     4000      Dev
3  David   40  Marseille     5000  Manager

In [29]:
df.loc[(df['poste'] == 'Data') & (df['ville'] == 'Paris')]

       nom  age  ville  salaire poste
0    Alice   25  Paris     3000  Data
2  Charlie   35  Paris     3500  Data

In [30]:
df.loc[df['poste'] == 'Data', 'salaire'] *= 1.1

C:\Users\johana\AppData\Local\Temp\ipykernel_9664\3241984002.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value '[3300. 3850.]' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  df.loc[df['poste'] == 'Data', 'salaire'] *= 1.1

In [31]:
df.loc[df['ville'] =='Lyon','ville'] = 'Bordeaux'
df

       nom  age      ville  salaire    poste
0    Alice   25      Paris   3300.0     Data
1      Bob   30   Bordeaux   4000.0      Dev
2  Charlie   35      Paris   3850.0     Data
3    David   40  Marseille   5000.0  Manager
4      Eva   28      Lille   3200.0      Dev

In [33]:
df.loc[df['nom'] == 'Bob', 'salaire'] = None
df

       nom  age      ville  salaire    poste
0    Alice   25      Paris   3300.0     Data
1      Bob   30   Bordeaux      NaN      Dev
2  Charlie   35      Paris   3850.0     Data
3    David   40  Marseille   5000.0  Manager
4      Eva   28      Lille   3200.0      Dev

In [34]:
df.iloc[3]

nom            David
age               40
ville      Marseille
salaire       5000.0
poste        Manager
Name: 3, dtype: object

In [36]:
df.iloc[len(df)-2:] # 2 dernière ligne

     nom  age      ville  salaire    poste
3  David   40  Marseille   5000.0  Manager
4    Eva   28      Lille   3200.0      Dev

In [43]:
df.filter(['salaire','poste']) # avec les noms 
df.iloc[:,[3,4]] # positionnel

   salaire    poste
0   3300.0     Data
1      NaN      Dev
2   3850.0     Data
3   5000.0  Manager
4   3200.0      Dev

In [48]:
df.iloc[[0,3],[1,4]]

   age    poste
0   25     Data
3   40  Manager

In [57]:
df.drop(df[df['ville'] == 'Marseille'].index)

       nom  age     ville  salaire poste
0    Alice   25     Paris   3300.0  Data
1      Bob   30  Bordeaux      NaN   Dev
2  Charlie   35     Paris   3850.0  Data
4      Eva   28     Lille   3200.0   Dev

# Notions abbordées 
Loc - iloc <br>
slicing <br>
merge vs join <br> 
structure de données

## Exo 10

In [83]:
def stats(*args) : 
    somme = 0
    for i in range(len(args)) : 
        somme += args[i]
    return max(*args), somme, int(somme/len(args))
print(stats(1, 2, 3))
print(stats(10, 20, 30, 40))

(3, 6, 2)
(40, 100, 25)

In [ ]:
def facture(*args, **kwargs) :